logs/generar_factura_1774556735499_request.xml

<?xml version="1.0" encoding="utf-8"?>
                <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ar="http://ar.gov.afip.dif.FEV1/">
                <soapenv:Header/>
                <soapenv:Body>
                    <ar:FECAESolicitar>
                        <ar:Auth>
                            <ar:Token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhLCBPPUFGSVAsIEM9QVIsIFNFUklBTE5VTUJFUj1DVUlUIDMzNjkzNDUwMjM5IiBkc3Q9IkNOPXdzZmUsIE89QUZJUCwgQz1BUiIgdW5pcXVlX2lkPSI3NjM2NTgxMTkiIGdlbl90aW1lPSIxNzc0NTU0MjI5IiBleHBfdGltZT0iMTc3NDU5NzQ4OSIvPgogICAgPG9wZXJhdGlvbiB0eXBlPSJsb2dpbiIgdmFsdWU9ImdyYW50ZWQiPgogICAgICAgIDxsb2dpbiBlbnRpdHk9IjMzNjkzNDUwMjM5IiBzZXJ2aWNlPSJ3c2ZlIiB1aWQ9IlNFUklBTE5VTUJFUj1DVUlUIDIwMzEyMzU0ODQ2LCBDTj1hZG9sZm9hcmF5YSIgYXV0aG1ldGhvZD0iY21zIiByZWdtZXRob2Q9IjIyIj4KICAgICAgICAgICAgPHJlbGF0aW9ucz4KICAgICAgICAgICAgICAgIDxyZWxhdGlvbiBrZXk9IjIwMzEyMzU0ODQ2IiByZWx0eXBlPSI0Ii8+CiAgICAgICAgICAgIDwvcmVsYXRpb25zPgogICAgICAgIDwvbG9naW4+CiAgICA8L29wZXJhdGlvbj4KPC9zc28+Cg==</ar:Token>
                            <ar:Sign>bSsMQ4UWoimR7hfXfAdP9hWnLn5yWDNRsKrOpW5vPmIv7bEQE5tk+mTEHkrzA9usrFqSgEmdduwvE9pFQqNlfcdnvFhDDH7UxkcbM+VRlgEyZfJe1KvcdSDD7H1yt7qyqgdCu0ROWPEpZoW0DjM2cHcKp9uPzASYvpHeD/prcG4=</ar:Sign>
                            <ar:Cuit>20312354846</ar:Cuit>
                        </ar:Auth>
                        <ar:FeCAEReq>
                            <ar:FeCabReq>
                            <ar:CantReg>1</ar:CantReg>
                            <ar:PtoVta>1002</ar:PtoVta>
                            <ar:CbteTipo>11</ar:CbteTipo>
                            </ar:FeCabReq>
                            <ar:FeDetReq>
                            <ar:FECAEDetRequest>
                                <ar:CondicionIVAReceptorId>1</ar:CondicionIVAReceptorId>
                                <ar:Concepto>3</ar:Concepto>
                                <ar:DocTipo>80</ar:DocTipo>
                                <ar:DocNro>30707617078</ar:DocNro>
                                <ar:CbteDesde>3</ar:CbteDesde>
                                <ar:CbteHasta>3</ar:CbteHasta>
                                <ar:CbteFch>20260326</ar:CbteFch>
                                <ar:FchServDesde>20260201</ar:FchServDesde>
                                <ar:FchServHasta>20260228</ar:FchServHasta>
                                <ar:FchVtoPago>20260331</ar:FchVtoPago>
                                <ar:ImpTotal>2727500</ar:ImpTotal>
                                <ar:ImpTotConc>0</ar:ImpTotConc>
                                <ar:ImpNeto>2727500</ar:ImpNeto>
                                <ar:ImpOpEx>0</ar:ImpOpEx>
                                <ar:ImpIVA>0</ar:ImpIVA>
                                <ar:ImpTrib>0</ar:ImpTrib>
                                <ar:MonId>PES</ar:MonId>
                                <ar:MonCotiz>1</ar:MonCotiz>
                                <ar:Observaciones>
                                    <ar:Obs>
                                        <ar:Code>002</ar:Code>
                                        <ar:Msg>Servicios IT - Desarrollo</ar:Msg>
                                    </ar:Obs>
                                </ar:Observaciones>
                            </ar:FECAEDetRequest>
                            </ar:FeDetReq>
                        </ar:FeCAEReq>
                    </ar:FECAESolicitar>
                </soapenv:Body>
                </soapenv:Envelope>