neumatic/prueba.xml

<?xml version="1.0" ?>
<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" soap:encodingStyle="http://schemas.xmlsoap.org/soap/envelope/encoding/">
    <soap:Header/>
    <soap:Body>
        <FECAESolicitar xmlns="http://ar.gov.afip.dif.FEV1/">
            <Auth>
                <Token>Token de Prueba</Token>
                <Sign>Firma de prueba</Sign>
                <Cuit>30692402363</Cuit>
            </Auth>
            <FeCAEReq>
                <FeCabReq>
                    <CantReg>1</CantReg>
                    <PtoVta>0001</PtoVta>
                    <CbteTipo>001</CbteTipo>
                </FeCabReq>
                <FeDetReq>
                    <FECAEDetRequest>
                        <Concepto>1</Concepto>
                        <DocTipo>80</DocTipo>
                        <DocNro>20000000001</DocNro>
                        <CbteDesde>00000001</CbteDesde>
                        <CbteHasta>00000001</CbteHasta>
                        <CbteFch>20250824</CbteFch>
                        <ImpTotal>100.00</ImpTotal>
                        <ImpTotConc>0.00</ImpTotConc>
                        <ImpNeto>82.64</ImpNeto>
                        <ImpOpEx>0.00</ImpOpEx>
                        <ImpTrib>0.00</ImpTrib>
                        <ImpIVA>17.36</ImpIVA>
                        <FchServDesde>20250824</FchServDesde>
                        <FchServHasta>20250824</FchServHasta>
                        <FchVtoPago>20250923</FchVtoPago>
                        <MonId>PES</MonId>
                        <MonCotiz>1.000</MonCotiz>
                        <CanMisMonExt>N</CanMisMonExt>
                        <CondicionIVAReceptorId>1</CondicionIVAReceptorId>
                        <Iva>
                            <AlicIva>
                                <Id>5</Id>
                                <BaseImp>82.64</BaseImp>
                                <Importe>17.36</Importe>
                            </AlicIva>
                        </Iva>
                    </FECAEDetRequest>
                </FeDetReq>
            </FeCAEReq>
        </FECAESolicitar>
    </soap:Body>
</ns0:Envelope>